BOT_TOKEN = '7846022173:AAG78_lVQWQ3rpsjd-XIfIYSQQkRq0EsykM'

bot_url = "https://t.me/razme_bot?start=fromchat"

post_emoji_1 = "📝"
spec_emoji_1 = "⭐️"
spec_emoji_2 = "🦊"

chat_id = -4724123511
admin_chat_id = 341548875

admin_ids = [341548875]

support_link = "t.me/grestedjesko"

main_menu_first_text = '''Привет, %s!

Чтобы разместить объявление нужно попополнить баланс или подключить пакет.

Для навигации по боту, используй кнопки ниже ⤵️'''

main_menu_text = '''Привет, %s! 

Для размещения объявления нажми кнопку ниже ⤵️'''

payment_text = f'''💳 Пополнение баланса на %s ₽
 
Производя оплату вы соглашаетесь с офертой (http://mpchats.ru/designers/oferta.html)

Возникли трудности или вопросы? Пишите @grestedjesko'''

payment_packet_text = f'''💳 Покупка пакета «%s» за %s₽

Производя оплату вы соглашаетесь с офертой (http://mpchats.ru/designers/oferta.html)

Возникли трудности или вопросы? Пишите @grestedjesko'''

merchant_id = 1
api_key = 'KQG5rUH0reoq6EvlUUjDmSR6auDyexzA'


packet_text = '''<b>🎯 Покупка пакетов</b>

Разовое объявление не всегда дает быстрый результат – его могут просто не заметить среди других сообщений.

🔹 <b>С пакетом</b> ваше объявление публикуется несколько раз в день 📅 – так его точно увидит больше людей.

📌 <b>Можно запланировать публикации заранее</b> – и больше не тратить силы на поиск клиентов.

Выберите тип пакета:'''


price_text = f'''📢 В нашем чате есть два способа размещения объявлений:

%s
Чтобы воспользоваться им — просто пополните баланс.

🛍 <b>Пакеты размещений</b> – публикация несколько раз в день:
<blockquote>%s</blockquote>
 
❓ Кнопка не работает? Напишите боту /start 📩'''

chat_text = '''🚀 Разместить объявление в этом чате можно с помощью бота @dizain_wb_bot'''

end_packet_text = '''❗️ Срок вашего пакета подошел к концу, приобретите новый пакет, чтобы продолжить размещать рекламу'''

activate_packet_text = '''Вы успешно подключили пакет. Активируем его сейчас или с завтрашнего дня?'''

success_time_change_text = "Новое время публикации успешно установлено"

yoo_account_id = '969570'
yoo_account_key = 'test_E37ZXZPoyevmDZBGDeKC34SmKk3zU4CdfVln-OBlxx0'

success_posted_text = """☑️ Объявление опубликовано"""
success_auto_posted_text = """☑️ Вы включили публикацию объявления в %s до %s"""

limit_exceeded_text = "Ваш лимит на сегодня закончился. Хотите разместить объявление поштучно с оплатой с баланса?"

low_balance_text = "На вашем балансе недостаточно средств. Для размещения нужно пополнить его или купить пакет"

success_bought_packet = """✅ <b>Вы успешно купили пакет на %s</b>.

📅 Ваш пакет будет автоматически <b>активирован завтра (%s) в 00:00</b>.  
Но вы можете активировать его прямо сейчас — нажмите кнопку ниже."""

success_prolonged_packet = """✅ <b>Вы успешно купили пакет на %s</b>.

📅 Ваш пакет <b>продлён</b> с учетом текущих лимитов и теперь будет <b>действовать до %s</b>."""

success_activated_packet = """✅ <b>Вы успешно активировали пакет на %s</b>.

📅 Ваш пакет будет действовать до %s."""

error_activation_packet = """⚠️ Возникла ошибка при активации пакета. Напишите администратору, мы во всем разберемся"""


balance_text = """💰 Ваш текущий баланс: %s₽  

Его хватит на %s"""

balance_active_packet_text = """💰 Ваш баланс: %s₽  

Ваш пакет: %s  
Обьявлений на сегодня:  %s  
Действует до: %s  
"""

balance_inactive_packet_text = """💰 Ваш баланс: %s₽  

⚠️ У вас есть <b>неактивный пакет</b>!  

Тип пакета: %s  
Автоматически активируется: %s  
Будет действовать до: %s"""

offer_buy_packet = """Средств на вашем балансе хватает на покупку пакета. Подключите его и размещайте объявления со скидкой"""




chat_map = {
    "error": '341548875',
    "deposit": '-4662413014',
    "registration": '-4726966911',
    "management": '-4726966911',
    "sale_conversions": '-4726966911',
    "posting": '-4726966911',
    "packet": "-4726966911",
    "post_conversion": "-4726966911"
}
