BOT_TOKEN = '7846022173:AAG78_lVQWQ3rpsjd-XIfIYSQQkRq0EsykM'


post_emoji_1 = "📝"
spec_emoji_1 = "⭐️"
spec_emoji_2 = "🦊"

chat_id = -4724123511

support_link = "t.me/grestedjesko"

main_menu_text = '''Привет, %s!

Чтобы разместить объявление нужно выбрать тариф.

Для навигации по боту, используй кнопки ниже ⤵️'''


payment_text = f'''💳 Пополнение баланса на %s ₽
 
Производя оплату вы соглашаетесь с офертой (http://mpchats.ru/designers/oferta.html)

Возникли трудности или вопросы? Пишите @grestedjesko'''

payment_packet_text = f'''💳 Покупка пакета «%s» за %s₽

Производя оплату вы соглашаетесь с офертой (http://mpchats.ru/designers/oferta.html)

Возникли трудности или вопросы? Пишите @grestedjesko'''

merchant_id = 73
api_key = 'KQG5rUH0reoq6EvlUUjDmSR6auDyexzA'


packet_text = '''Пакеты дают возможность получить больше откликов, чем штучные размещения. А также позволяют размещать объявления автоматически.

Выберите тип пакета:'''

chat_text = '''🚀 Разместить объявление в этом чате можно с помощью бота @dizain_wb_bot'''