BOT_TOKEN = '7846022173:AAG78_lVQWQ3rpsjd-XIfIYSQQkRq0EsykM'

bot_url = "https://t.me/razme_bot?start=fromchat"

post_emoji_1 = "📝"
spec_emoji_1 = "⭐️"
spec_emoji_2 = "🦊"

chat_id = -4724123511
admin_chat_id = 341548875

support_link = "t.me/grestedjesko"

main_menu_text = '''Привет, %s!

Чтобы разместить объявление нужно выбрать тариф.

Для навигации по боту, используй кнопки ниже ⤵️'''


payment_text = f'''💳 Пополнение баланса на %s ₽
 
Производя оплату вы соглашаетесь с офертой (http://mpchats.ru/designers/oferta.html)

Возникли трудности или вопросы? Пишите @grestedjesko'''

payment_packet_text = f'''💳 Покупка пакета «%s» за %s₽

Производя оплату вы соглашаетесь с офертой (http://mpchats.ru/designers/oferta.html)

Возникли трудности или вопросы? Пишите @grestedjesko'''

merchant_id = 73
api_key = 'KQG5rUH0reoq6EvlUUjDmSR6auDyexzA'


packet_text = '''<b>🎯 Покупка пакетов</b>

Разовое объявление не всегда дает быстрый результат – его могут просто не заметить среди других сообщений.

🔹 **С пакетом** ваше объявление публикуется несколько раз в день 📅 – так его точно увидит больше людей.

📌 **Можно запланировать публикации заранее** – и больше не тратить силы на поиск клиентов.

Выберите тип пакета:'''


price_text = f'''📢 В нашем чате есть два способа размещения объявлений:

%s
Чтобы воспользоваться им — просто пополните баланс.

🛍 <b>Пакеты размещений</b> – публикация несколько раз в день:
%s
 
❓ Кнопка не работает? Напишите боту /start 📩'''

chat_text = '''🚀 Разместить объявление в этом чате можно с помощью бота @dizain_wb_bot'''

end_packet_text = '''❗️ Срок вашего пакета подошел к концу, приобретите новый пакет, чтобы продолжить размещать рекламу'''

activate_packet_text = '''Вы успешно подключили пакет. Активируем его сейчас или с завтрашнего дня?'''