BOT_TOKEN = '5318319553:AAGb6HNSu-bRwqkM-0lF0RXCsEZqz55yz1c'

bot_url = "https://t.me/dizain_wb_bot?start=fromchat"

post_emoji_1 = "📝"
spec_emoji_1 = "⭐️"
spec_emoji_2 = "🦊"

chat_id = -1001766236240
admin_chat_id = 341548875

admin_ids = [341548875]

admin_url = '@designers_admin'

support_link = "t.me/designers_admin"

onboarding_text = """Привет! 👋
Этот бот поможет тебе разместить объявление в чате.

<blockquote>У нас есть два варианта размещения:
💬 <b>Поштучное</b> — пополняешь баланс, например, на 2 размещения, и публикуешь, когда удобно.
🛍 <b>Пакетное</b> — подключаешь размещения на срок (например, 7 дней по 3 размещения в день).
Это выгоднее и помогает охватить больше людей 🚀
</blockquote>

Хочешь узнать цены? <b>Жми на кнопку «Тарифы».</b>
Если что-то будет непонятно — загляни в инструкцию 📘.
"""

main_menu_first_text = '''Привет, %s!

Чтобы разместить объявление нужно попополнить баланс или подключить пакет.

Для навигации по боту, используй кнопки ниже ⤵️'''

main_menu_text_hi = '''Привет, %s! 

Для размещения объявления нажми кнопку ниже ⤵️'''

main_menu_text = ''' 
Для размещения объявления нажми кнопку ниже ⤵️'''

payment_text = f'''💳 Пополнение баланса на %s ₽
 
Производя оплату вы соглашаетесь с <a href="http://mpchats.ru/dizain/oferta.html">офертой</a>

Возникли трудности или вопросы? Пишите @grestedjesko'''

payment_packet_text = f'''💳 Покупка пакета «%s» за %s₽

Производя оплату вы соглашаетесь с <a href="http://mpchats.ru/dizain/oferta.html">офертой</a>

Возникли трудности или вопросы? Пишите @grestedjesko'''

merchant_id = 1
api_key = 'KQG5rUH0reoq6EvlUUjDmSR6auDyexzA'


packet_text = '''Разовое объявление не всегда дает быстрый результат – его могут просто не заметить среди других сообщений.

<blockquote>🔹 <b>С пакетом</b> ваше объявление публикуется несколько раз в день. Так его точно увидит больше людей.
📌 <b>Можно запланировать публикации заранее</b> и больше не тратить силы на поиск клиентов.
⏸ А в случае чего - пакет можно ставить на паузу. Ничего не сгорит.
</blockquote>

Выберите тип пакета:'''


price_text = f'''Можно пополнить баланс на любую сумму (например 500 рублей) и размещать поштучно или приобрести пакет размещений.

<blockquote>%s

🛍 <b>Пакеты размещений</b>:
%s
</blockquote>

<blockquote><b> Фишки пакета размещений: </b>
🕐 Публикация автоматически, в заданное время  
👀 Больше показов = больше откликов. Проверено
⏸ Можно поставить на паузу. Ничего не сгорит</blockquote>

❓ Кнопка не работает? напишите боту /start 📩'''



chat_text = '''🚀 Разместить объявление в этом чате можно с помощью бота @dizain_wb_bot'''

end_packet_text = '''❗️ Срок вашего пакета подошел к концу, приобретите новый пакет, чтобы продолжить размещать рекламу'''

activate_packet_text = '''Вы успешно подключили пакет. Активируем его сейчас или с завтрашнего дня?'''

success_time_change_text = "Новое время публикации успешно установлено"

yoo_account_id = '973010'
yoo_account_key = 'live_Fw41IzmhT8vkHZQOfibLW3g-CwmKChw2KgQ-MlmxfHA'

success_posted_text = """☑️ Объявление опубликовано"""
success_auto_posted_text = """☑️ Вы включили публикацию объявления в %s до %s"""

limit_exceeded_text = "Ваш лимит на сегодня закончился. Хотите разместить объявление поштучно с оплатой с баланса?"

low_balance_text = "На вашем балансе недостаточно средств. Для размещения нужно пополнить его или купить пакет"

success_bought_packet = """✅ <b>Вы успешно купили пакет на %s</b>.

📅 Ваш пакет будет автоматически <b>активирован завтра (%s) в 00:00</b>.  
Но вы можете активировать его прямо сейчас — нажмите кнопку ниже."""

success_prolonged_packet = """✅ <b>Вы успешно купили пакет на %s</b>.

📅 Ваш пакет <b>продлён</b> с учетом текущих лимитов и теперь будет <b>действовать до %s</b>."""

success_activated_packet = """✅ <b>Вы успешно активировали пакет на %s</b>.

📅 Ваш пакет будет действовать до %s."""

success_paused_packet = """⏸️ Вы успешно поставили пакет на паузу на 3 дня.

📅 Ваш пакет будет автоматически <b>активирован %s в 00:00</b>.  
Но вы можете активировать его прямо сейчас — нажмите кнопку ниже."""

error_activation_packet = """⚠️ Возникла ошибка при активации пакета. Напишите администратору, мы во всем разберемся"""


balance_text = """💰 Ваш текущий баланс: %s₽  

Его хватит на %s"""

balance_active_packet_text = """💰 Ваш баланс: %s₽  

Ваш пакет: %s  
Обьявлений на сегодня:  %s  
Действует до: %s  
"""

balance_inactive_packet_text = """💰 Ваш баланс: %s₽  

⚠️ У вас есть <b>неактивный пакет</b>!  

Тип пакета: %s  
Автоматически активируется: %s  
Будет действовать до: %s"""


offer_buy_packet = """Средств на вашем балансе хватает на покупку пакета. Подключите его и размещайте объявления со скидкой"""

chat_map = {
    "error": '341548875', # ошибки бота
    "deposit": '-4662413014', # пополнения балансов
    "registration": '-4726966911', # регистрация
    "management": '-4695596147', # заявки чтобы менеджер написал узнла
    "sale_conversions": '-4620645771', # конверсии по промокодам
    "bonus": "-4741410593",
    "post_conversion": "-4694949453",
    "report": "-4683725015",
}

max_image_count = 1

